<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"0a4c2823a12c8d2f54e00d3193cc5e6fe572fcdaf177d8eabc9ab5a3b850d789","plan_job_ref":"Job Create Terraform plan (DEV) #115 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15050880180","plan_out_hash":"27a6ba86490dda74cdedbd38668c1cee0f55dd33b5bdb8a1df4e9ddc724a332a","plan_hash":"32f74d275281f53d6c262f3cbf47bd09f449f3b665f062bf8f25b7741be0400e","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.oauth2_proxy will be created
+   resource "helm_release" "oauth2_proxy" {
+       atomic                     = false
+       chart                      = "oauth2-proxy"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "oauth2-proxy"
+       namespace                  = "authgate"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://oauth2-proxy.github.io/manifests"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                existingSecret: oauth2-proxy-secret   # contains client-id / client-secret / cookie-secret
                
                config:
                  provider: oidc
                  oidcIssuerUrl: "https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0"  
                  emailDomains: ["audioprotheseplus.onmicrosoft.com"]            
                  cookieSecure: true           
                
                ingress:
                  enabled: false             
                
                service:
                  type: ClusterIP
                  port: 4180
            EOT,
        ]
+       verify                     = false
+       version                    = "7.12.13"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #115](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15050880180)